espressif/esp-idf/components/soc/esp32c61/include/modem/modem_syscon_reg.h
/** MODEM_SYSCON_CLK_CONF1_REG register **/
#define MODEM_SYSCON_CLK_CONF1_REG (DR_REG_MODEM_SYSCON_BASE + 0x14)
/** MODEM_SYSCON_CLK_WIFIBB_22M_EN : R/W; bitpos: [0]; default: 0; **/
#define MODEM_SYSCON_CLK_WIFIBB_22M_EN    (BIT(0))
#define MODEM_SYSCON_CLK_WIFIBB_22M_EN_M  (MODEM_SYSCON_CLK_WIFIBB_22M_EN_V << MODEM_SYSCON_CLK_WIFIBB_22M_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_22M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_22M_EN_S  0
/** MODEM_SYSCON_CLK_WIFIBB_40M_EN : R/W; bitpos: [1]; default: 0; **/
#define MODEM_SYSCON_CLK_WIFIBB_40M_EN    (BIT(1))
#define MODEM_SYSCON_CLK_WIFIBB_40M_EN_M  (MODEM_SYSCON_CLK_WIFIBB_40M_EN_V << MODEM_SYSCON_CLK_WIFIBB_40M_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_40M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_40M_EN_S  1
/** MODEM_SYSCON_CLK_WIFIBB_44M_EN : R/W; bitpos: [2]; default: 0; **/
#define MODEM_SYSCON_CLK_WIFIBB_44M_EN    (BIT(2))
#define MODEM_SYSCON_CLK_WIFIBB_44M_EN_M  (MODEM_SYSCON_CLK_WIFIBB_44M_EN_V << MODEM_SYSCON_CLK_WIFIBB_44M_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_44M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_44M_EN_S  2
/** MODEM_SYSCON_CLK_WIFIBB_80M_EN : R/W; bitpos: [3]; default: 0; **/
#define MODEM_SYSCON_CLK_WIFIBB_80M_EN    (BIT(3))
#define MODEM_SYSCON_CLK_WIFIBB_80M_EN_M  (MODEM_SYSCON_CLK_WIFIBB_80M_EN_V << MODEM_SYSCON_CLK_WIFIBB_80M_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_80M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_80M_EN_S  3
/** MODEM_SYSCON_CLK_WIFIBB_40X_EN : R/W; bitpos: [4]; default: 0; **/
#define MODEM_SYSCON_CLK_WIFIBB_40X_EN    (BIT(4))
#define MODEM_SYSCON_CLK_WIFIBB_40X_EN_M  (MODEM_SYSCON_CLK_WIFIBB_40X_EN_V << MODEM_SYSCON_CLK_WIFIBB_40X_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_40X_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_40X_EN_S  4
/** MODEM_SYSCON_CLK_WIFIBB_80X_EN : R/W; bitpos: [5]; default: 0; **/
#define MODEM_SYSCON_CLK_WIFIBB_80X_EN    (BIT(5))
#define MODEM_SYSCON_CLK_WIFIBB_80X_EN_M  (MODEM_SYSCON_CLK_WIFIBB_80X_EN_V << MODEM_SYSCON_CLK_WIFIBB_80X_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_80X_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_80X_EN_S  5
/** MODEM_SYSCON_CLK_WIFIBB_40X1_EN : R/W; bitpos: [6]; default: 0; **/
#define MODEM_SYSCON_CLK_WIFIBB_40X1_EN    (BIT(6))
#define MODEM_SYSCON_CLK_WIFIBB_40X1_EN_M  (MODEM_SYSCON_CLK_WIFIBB_40X1_EN_V << MODEM_SYSCON_CLK_WIFIBB_40X1_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_40X1_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_40X1_EN_S  6
/** MODEM_SYSCON_CLK_WIFIBB_80X1_EN : R/W; bitpos: [7]; default: 0; **/
#define MODEM_SYSCON_CLK_WIFIBB_80X1_EN    (BIT(7))
#define MODEM_SYSCON_CLK_WIFIBB_80X1_EN_M  (MODEM_SYSCON_CLK_WIFIBB_80X1_EN_V << MODEM_SYSCON_CLK_WIFIBB_80X1_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_80X1_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_80X1_EN_S  7
/** MODEM_SYSCON_CLK_WIFIBB_160X1_EN : R/W; bitpos: [8]; default: 0; **/
#define MODEM_SYSCON_CLK_WIFIBB_160X1_EN    (BIT(8))
#define MODEM_SYSCON_CLK_WIFIBB_160X1_EN_M  (MODEM_SYSCON_CLK_WIFIBB_160X1_EN_V << MODEM_SYSCON_CLK_WIFIBB_160X1_EN_S)
#define MODEM_SYSCON_CLK_WIFIBB_160X1_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIBB_160X1_EN_S  8
/** MODEM_SYSCON_CLK_WIFIMAC_EN : R/W; bitpos: [9]; default: 0; **/
#define MODEM_SYSCON_CLK_WIFIMAC_EN    (BIT(9))
#define MODEM_SYSCON_CLK_WIFIMAC_EN_M  (MODEM_SYSCON_CLK_WIFIMAC_EN_V << MODEM_SYSCON_CLK_WIFIMAC_EN_S)
#define MODEM_SYSCON_CLK_WIFIMAC_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFIMAC_EN_S  9
/** MODEM_SYSCON_CLK_WIFI_APB_EN : R/W; bitpos: [10]; default: 0; **/
#define MODEM_SYSCON_CLK_WIFI_APB_EN    (BIT(10))
#define MODEM_SYSCON_CLK_WIFI_APB_EN_M  (MODEM_SYSCON_CLK_WIFI_APB_EN_V << MODEM_SYSCON_CLK_WIFI_APB_EN_S)
#define MODEM_SYSCON_CLK_WIFI_APB_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_WIFI_APB_EN_S  10
/** MODEM_SYSCON_CLK_FE_20M_EN : R/W; bitpos: [11]; default: 0; **/
#define MODEM_SYSCON_CLK_FE_20M_EN    (BIT(11))
#define MODEM_SYSCON_CLK_FE_20M_EN_M  (MODEM_SYSCON_CLK_FE_20M_EN_V << MODEM_SYSCON_CLK_FE_20M_EN_S)
#define MODEM_SYSCON_CLK_FE_20M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_20M_EN_S  11
/** MODEM_SYSCON_CLK_FE_40M_EN : R/W; bitpos: [12]; default: 0; **/
#define MODEM_SYSCON_CLK_FE_40M_EN    (BIT(12))
#define MODEM_SYSCON_CLK_FE_40M_EN_M  (MODEM_SYSCON_CLK_FE_40M_EN_V << MODEM_SYSCON_CLK_FE_40M_EN_S)
#define MODEM_SYSCON_CLK_FE_40M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_40M_EN_S  12
/** MODEM_SYSCON_CLK_FE_80M_EN : R/W; bitpos: [13]; default: 0; **/
#define MODEM_SYSCON_CLK_FE_80M_EN    (BIT(13))
#define MODEM_SYSCON_CLK_FE_80M_EN_M  (MODEM_SYSCON_CLK_FE_80M_EN_V << MODEM_SYSCON_CLK_FE_80M_EN_S)
#define MODEM_SYSCON_CLK_FE_80M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_80M_EN_S  13
/** MODEM_SYSCON_CLK_FE_160M_EN : R/W; bitpos: [14]; default: 0; **/
#define MODEM_SYSCON_CLK_FE_160M_EN    (BIT(14))
#define MODEM_SYSCON_CLK_FE_160M_EN_M  (MODEM_SYSCON_CLK_FE_160M_EN_V << MODEM_SYSCON_CLK_FE_160M_EN_S)
#define MODEM_SYSCON_CLK_FE_160M_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_160M_EN_S  14
/** MODEM_SYSCON_CLK_FE_APB_EN : R/W; bitpos: [15]; default: 0; **/
#define MODEM_SYSCON_CLK_FE_APB_EN    (BIT(15))
#define MODEM_SYSCON_CLK_FE_APB_EN_M  (MODEM_SYSCON_CLK_FE_APB_EN_V << MODEM_SYSCON_CLK_FE_APB_EN_S)
#define MODEM_SYSCON_CLK_FE_APB_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_APB_EN_S  15
/** MODEM_SYSCON_CLK_BT_APB_EN : R/W; bitpos: [16]; default: 0; **/
#define MODEM_SYSCON_CLK_BT_APB_EN    (BIT(16))
#define MODEM_SYSCON_CLK_BT_APB_EN_M  (MODEM_SYSCON_CLK_BT_APB_EN_V << MODEM_SYSCON_CLK_BT_APB_EN_S)
#define MODEM_SYSCON_CLK_BT_APB_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_BT_APB_EN_S  16
/** MODEM_SYSCON_CLK_BTBB_EN : R/W; bitpos: [17]; default: 0; **/
#define MODEM_SYSCON_CLK_BTBB_EN    (BIT(17))
#define MODEM_SYSCON_CLK_BTBB_EN_M  (MODEM_SYSCON_CLK_BTBB_EN_V << MODEM_SYSCON_CLK_BTBB_EN_S)
#define MODEM_SYSCON_CLK_BTBB_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_BTBB_EN_S  17
/** MODEM_SYSCON_CLK_BTMAC_EN : R/W; bitpos: [18]; default: 0; **/
#define MODEM_SYSCON_CLK_BTMAC_EN    (BIT(18))
#define MODEM_SYSCON_CLK_BTMAC_EN_M  (MODEM_SYSCON_CLK_BTMAC_EN_V << MODEM_SYSCON_CLK_BTMAC_EN_S)
#define MODEM_SYSCON_CLK_BTMAC_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_BTMAC_EN_S  18
/** MODEM_SYSCON_CLK_FE_PWDET_ADC_EN : R/W; bitpos: [19]; default: 0; **/
#define MODEM_SYSCON_CLK_FE_PWDET_ADC_EN    (BIT(19))
#define MODEM_SYSCON_CLK_FE_PWDET_ADC_EN_M  (MODEM_SYSCON_CLK_FE_PWDET_ADC_EN_V << MODEM_SYSCON_CLK_FE_PWDET_ADC_EN_S)
#define MODEM_SYSCON_CLK_FE_PWDET_ADC_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_PWDET_ADC_EN_S  19
/** MODEM_SYSCON_CLK_FE_ADC_EN : R/W; bitpos: [20]; default: 0; **/
#define MODEM_SYSCON_CLK_FE_ADC_EN    (BIT(20))
#define MODEM_SYSCON_CLK_FE_ADC_EN_M  (MODEM_SYSCON_CLK_FE_ADC_EN_V << MODEM_SYSCON_CLK_FE_ADC_EN_S)
#define MODEM_SYSCON_CLK_FE_ADC_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_ADC_EN_S  20
/** MODEM_SYSCON_CLK_FE_DAC_EN : R/W; bitpos: [21]; default: 0; **/
#define MODEM_SYSCON_CLK_FE_DAC_EN    (BIT(21))
#define MODEM_SYSCON_CLK_FE_DAC_EN_M  (MODEM_SYSCON_CLK_FE_DAC_EN_V << MODEM_SYSCON_CLK_FE_DAC_EN_S)
#define MODEM_SYSCON_CLK_FE_DAC_EN_V  0x00000001U
#define MODEM_SYSCON_CLK_FE_DAC_EN_S  21

/** MODEM_SYSCON_WIFI_BB_CFG_REG register **/
#define MODEM_SYSCON_WIFI_BB_CFG_REG (DR_REG_MODEM_SYSCON_BASE + 0x18)
/** MODEM_SYSCON_WIFI_BB_CFG : R/W; bitpos: [31:0]; default: 0; **/
#define MODEM_SYSCON_WIFI_BB_CFG    0xFFFFFFFFU
#define MODEM_SYSCON_WIFI_BB_CFG_M  (MODEM_SYSCON_WIFI_BB_CFG_V << MODEM_SYSCON_WIFI_BB_CFG_S)
#define MODEM_SYSCON_WIFI_BB_CFG_V  0xFFFFFFFFU
#define MODEM_SYSCON_WIFI_BB_CFG_S  0

/** MODEM_SYSCON_FE_CFG_REG register **/
#define MODEM_SYSCON_FE_CFG_REG (DR_REG_MODEM_SYSCON_BASE + 0x1c)
/** MODEM_SYSCON_FE_CFG : R/W; bitpos: [31:0]; default: 0; **/
#define MODEM_SYSCON_FE_CFG    0xFFFFFFFFU
#define MODEM_SYSCON_FE_CFG_M  (MODEM_SYSCON_FE_CFG_V << MODEM_SYSCON_FE_CFG_S)
#define MODEM_SYSCON_FE_CFG_V  0xFFFFFFFFU
#define MODEM_SYSCON_FE_CFG_S  0

/** MODEM_SYSCON_MEM_RF1_CONF_REG register **/
#define MODEM_SYSCON_MEM_RF1_CONF_REG (DR_REG_MODEM_SYSCON_BASE + 0x20)
/** MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 8304; **/
#define MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL    0xFFFFFFFFU
#define MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_M  (MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_V << MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_S)
#define MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define MODEM_SYSCON_MODEM_RF1_MEM_AUX_CTRL_S  0

/** MODEM_SYSCON_MEM_RF2_CONF_REG register **/
#define MODEM_SYSCON_MEM_RF2_CONF_REG (DR_REG_MODEM_SYSCON_BASE + 0x24)
/** MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 0; **/
#define MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL    0xFFFFFFFFU
#define MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_M  (MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_V << MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_S)
#define MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define MODEM_SYSCON_MODEM_RF2_MEM_AUX_CTRL_S  0

/** MODEM_SYSCON_DATE_REG register **/
#define MODEM_SYSCON_DATE_REG (DR_REG_MODEM_SYSCON_BASE + 0x28)
/** MODEM_SYSCON_DATE : R/W; bitpos: [27:0]; default: 37823072; **/
#define MODEM_SYSCON_DATE    0x0FFFFFFFU
#define MODEM_SYSCON_DATE_M  (MODEM_SYSCON_DATE_V << MODEM_SYSCON_DATE_S)
#define MODEM_SYSCON_DATE_V  0x0FFFFFFFU
#define MODEM_SYSCON_DATE_S  0

#ifdef __cplusplus
}
#endif
